{"timestamp": "2025-07-05T02:33:40.312199", "category": "Animation Art", "content": "Heritage Auction\nBox Office Bunny Production Cel with Key Master Background (Warner Brothers, 1991). \"Eh, what's up, Doc?\" asks Bugs Bunny. \"Hey I don't see you come in. If you haven't got a ticket I must ask you to leave!\" says the usher Elmer Fudd. This cartoon showcased Bugs Bunny's return to the big screen in his first theatrical short since 1964. This great cartoon was directed by Darrel Van Citters with production design by Michael Giamo. Box Office Bunny was released on 2/8/91. A \"Cineminium 100 Screen Multiplex Movie Theater\" is constructed right over Bugs Bunny's rabbit hole home. This is an outstanding hand-painted production cel of Bugs and Elmer in the movie theater when they first meet. You can see this image at around the 1:25 mark into the cartoon. Great images of Bugs and Elmer measuring 6\" and 8\". The cels are on a hand-painted Key Master production background. This impressive setup is in a frame of 20\" x 16\" with a mat opening of 12\" x 8\". Frame is sold as-is. Artwork condition is Very Good. $500 $600 w/bp  \nSpike Production Cel Signed by Bill Hanna and Joe Barbera (Hanna-Barbera, c. 1990s). Great cel of Spike the Bulldog, most likely from the 1990s Tom & Jerry Kids series, which ran from 1990 until 1993 on Fox Kids. Big Spike has an overall image size of 8.25\" x 8.25\". Little Spike in bed is a print, added for presentation purposes. Cel includes an H-B seal, and is hand-signed by Bill Hanna (1910 - 2001) and Joe Barbera (1911 - 2006). Cel and print background have been stapled to a backing board. Condition is Very Good. $121.20  $13.10  $9.06 $143.36\n\n\"High Diving Sam\" Bugs Bunny and Yosemite Sam Limited Edition Cel #140/750 (Warner Brothers, 1994). In the 1948 cartoon High Diving Hare, Yosemite Sam splurges on tickets to see the high-diving act featuring \"Fearless Freep\" at Bugs Bunny's vaudeville show. When Freep is a no-show, Bugs continually tricks Sam into making the dive. This fantastic Virgil Ross Masters Collection limited edition hand-painted cel recreates the scene where Sam falls toward an empty tank, after which Bugs tosses a bucket of water; Sam is jumping on the water to push it down and land before he does (the water makes it into the tank, but Sam goes through the stage floor instead). Veteran animator Virgil Ross (1907 - 1996) worked on many of the classic Bugs Bunny cartoons during his long tenure at Warner Brothers. This is one of his very best Masters Collection limited edition cels, a vertical pan scene with Bugs, Sam, the bucket, and the water all painted on cel. Bugs has a figure size of 5.25\", while Sam is 4\". The scene-matching print background has been added for presentation purposes. The setup is matted with an opening of 10\" x 24\", framed with Plexiglas for an overall size of 18\" x 32\". A Warner Brothers COA is attached to the backside of the frame. Frame is sold as-is. Cel condition is Fine. \n  10/24 one sold for $408\nYogi Bear and Boo-Boo Consumer Products Cel and Background (Hanna-Barbera, c. 1970s-80s).\nHe's smarter than your average bear and always up for a good \"pic-a-nic basket\". Yogi Bear made his debut in 1958 as a supporting character in The Huckleberry Hound Show. In this lot we have a great cel of Yogi and his constant companion, Boo-Boo, who often acts as his conscience. This consumer products cel is hand-painted on 12 field acetate. The cel is on a hand-painted background. This is a nice large image of Yogi measuring 6.25\" tall in an image area of 8.5\" x 6.25\". The cel is in a mat measuring 13\" x 10.25\" with an opening of 8.75\" x 7\". Artwork is in Very Good condition. $87.00 $13.10 $6.75 $106.85\n\n\nPlease see full-color, enlargeable images above for more details.\n\nView movie details on IMDB\nView movie details on AllMovie\nhttps://www.allmovie.com/movie/cool-world-v10966\nThe Great Grape Ape Stock Production Cel (Hanna-Barbera, 1975). \"Grape Ape Grape Ape!\" This fun cartoon premiered on ABC on 9/6/75. It began as part of the Tom and Jerry/Grape Ape Show. This is an original hand-painted 12 field production cel of the Great Grape Ape on the roof of the yellow van driven by Beegle Beagle (aka Beegly Beagly). Isn't it funny how that roof never caves in! Excellent overall classic image, with a size of 6\". NOTE: This is a stock cel, meaning was used over and over, including opening title and bumper sequences. The cel is on a print background for presentation purposes. Minor handling wear. Condition is Very Good. \n\nStay Tuned Cartoon Roy and Helen Signed Pan Production Cel Setup with Key Master Background (Chuck Jones/Morgan Creek Productions, 1992). Cartoon mice John Ritter and Pam Dawber pop out of a red hot toaster, in this hand-painted production cel from the six-minute animated \"Rooney Tunes\" sequence directed by Chuck Jones. This 1992 live-action theatrical movie starred Mr. Ritter as a couch potato, who finds himself and his wife sucked into a hellish world of TV parodies. This is a 3-cel hand-painted pan setup with its Key Master production background; overall size is approximately 18.5\" x 10.5\". The top cel has been hand-signed by animation legend Chuck Jones (1912 - 2002), and includes a Linda Jones seal. The cel setup includes a Linda Jones Certificate of Authenticity; the background has a separate Linda Jones Letter of Authenticity. Very Good condition with minor handling and edge wear.\n\nBugs Bunny's 3rd Movie: 1001 Rabbit Tales Friends of Speedy Gonzales Signed Production Cel Setup (Warner Brothers, 1982). Speedy's amigos are the subject of this original hand-inked, hand-painted 12 field 2-cel setup. The two mice are on one cel, while the second is an effects cel. Figure sizes are 1.5\" and 2\". The cel has been hand-signed by animation legend Friz Freleng (1906 - 1995). A WB seal is on the cel, and a Linda Jones COA is included. Very Good condition with minor tape and handling.\nThe 13 Ghosts of Scooby Doo Scooby Production Cel (Hanna-Barbera, 1985). Cue the classic Hanna-Barbera \"braking\" sound effect! Hilarious expression on Scoob's face, as he works against momentum, scrambling furiously to avoid skidding into some obstacle - likely one of the very demons he's been hunting! An iconic character in an iconic pose, this is Scooby at his best! The image area on this hand-painted production cel measures roughly 5\" x 4\". In Fine condition.\nThe Flintstones Fred and Barney Production Cel and Key Master Background (Hanna-Barbera, c. 1970s).\nOffered in this lot is a magnificent Key Master Setup featuring Fred and Barney from The Flintstones. The Flintstones premiered on 9/30/60 and quickly became a hit. The groundbreaking show was the first American animated show to depict two people of the opposite sex (Fred and Wilma; Barney and Betty) sleeping together in one bed. And who could forget those Winston cigarette ads during the closing credits showing Fred and Wilma enjoying a cigarette. The cel was hand-painted on 12 field acetate and paired with the hand-painted original production background. The piece measures 13.25\" x 10.5\" and features full-figure images of Fred and Barney measuring 4.75\" and 3.5\" tall. Mild handling and wear. Condition is Very Good. \nThe Flintstones Pebbles & Bamm-Bamm Production Cel Art (Hanna-Barbera, 1978).\nThis is a superb production cel featuring Pebbles & Bamm-Bamm with the Great Gazoo flying overhead. The cel art was used for the cover of a Pebbles & Bamm-Bamm coloring book, \"Find Gazoo's Garden\". Hand-painted on 10.5\" x 11.5\" acetate and paired with a color card background. Pebbles & Bamm-Bamm measure 4\" tall. Included is a \"Find Gazoo's Garden\" coloring book. The coloring book has some age-related edge wear, in Good condition. The cel is in Very Good condition.\nThe Flintstones Production Cel and Background Layout Art (Hanna-Barbera, 1978).\nFred takes a dip in the pool in this outstanding production cel. The cel was created for use in an international Hanna-Barbera brochure. A preliminary brochure in several languages is included. The production cel is hand-painted on 12 field acetate and placed on the original background layout art. The background art is a panoramic size of 28.5\" and rendered in graphite with color pencil. Fred measures 4\" in an image area of 7\" x 5.5\". Also included is a color print of the final version. Normal handling wear. Condition is Good.\nJetsons: The Movie Production Cel and Key Master Background (Hanna-Barbera, 1990).\nJetsons: The Movie is a feature film produced by Hanna-Barbera and released by Universal Pictures on 7/6/90. The film was based on the television series The Jetsons. The picture stars George O'Hanlon, Penny Singleton, Don Messick and Mel Blanc, all veterans of the original television show. In this lot is a superb Key Master setup featuring George Jetson and Rudy 2. The cel is hand-painted on 12 field acetate and paired with the hand-painted Key Master background. The piece measures 12.5\" x 10.5\" with George measuring 5.75\" tall. Condition is Fine.\n\nSurf-Bored Cat Tom Cat and Starfish Production Cel Setup (MGM, 1967). Tom decides he wants to be a surfer in the worst way, and that's how he winds up, in this original hand-painted 12 field 2-cel setup. The short was produced by Chuck Jones and directed by Abe Levitow; it was released on 5/5/67. Tom finds himself stuck with a red starfish on his head in several scenes; this one can be found at the 4:40 mark within the short. The effects cel of a swirl around Tom's head has been added. Tom's figure size is 7.5\" wide. Top cel includes a Linda Jones seal. Background is a print, added for presentation purposes. A Chuck Jones Gallery Letter of Authenticity is included. Good condition, with cel curling and minor handling.\nWoody Woodpecker Production Cel and Painted Background (Walter Lantz, c. 1950s-60s). Most major animation studios stopped production by the 1960s, but Walter Lantz kept on releasing theatrical shorts starring Woody Woodpecker, Chilly Willy, and The Beary Family up to 1972. Here's an original hand-inked, hand-painted production cel of Woody, with a full-figure measuring 2.75\". The cel is placed on an original hand-painted production background from an unknown short. Cel has a 2.5\" tear along the bottom edge that does not affect the image. Good condition.\nRuff and Reddy from Tom and Jerry, Yogi Bear from The Honeymooners’ Ed Norton, Snooper and Blabber from Tom and Jerry, Top Cat from Phil Silvers, Wally Gator from Ed Wynn, the Jetsons from the Blondie film series, Secret Squirrel from James Bond, Penelope Pitstop from the damsel in distress motif from silent films, Scooby-Doo from Dobie Gillis, Jabberjaw from the film Jaws, Captain Caveman and the Teen Angels from Charlie’s Angels, Josie and the Pussycats from The Archies, and the Snorks from The Smurfs.\nThe Incredibles (Buena Vista, 2004). Rolled, Very Fine+. One Sheet (27\" X 40\") SS, Robert McGinnis Artwork. Animation.\nStarring the voices of Craig T. Nelson, Holly Hunter, Samuel L. Jackson, Jason Lee, and Dominique Louis. Directed by Brad Bird. An unrestored poster with bright color and a clean overall appearance. It may have general signs of use, such as slight edge wear, light creases, or very minor tears. A Walt Disney production.  $151.20 $11.53 $10.99 $173.72\nThumbelina Prince Cornelius and Hero Production Cel Setup with Key Master Production Background (Don Bluth, 1994). Prince Cornelius returns to visit Thumbelina only to find out from Hero the dog that she has been kidnapped. Don Bluth brought this Hans Christian Anderson story to the big screen in 1994 and it starred Jodi Benson (the voice of Disney's Little Mermaid, Ariel) as the voice of Thumbelina. Presented is an original hand-painted 16 field production cel setup of the Prince and Hero who together measure 14\" x 8\". The cel setup is over a hand-painted Key Master background from the film rendered in gouache on paper-board. This pivotal scene appears 25:03 into the film. It's a wonderful one-of-a-kind piece from the last film to come out of Don Bluth Ireland Ltd. The art is in a 23\" x 19\" frame under Plexiglas with a mat opening of 16\" x 12\". Minor handling and the cel has a fold crease in the lower right corner. Condition is Very Good. Frame is sold as-is.\n\nThe Huckleberry Hound Show Publicity Cel with Key Master Background (Hanna-Barbera, c. 1970s-80s). The Huckleberry Hound Show premiered on 9/27/58 and featured Huck along with Yogi Bear, and Pixie and Dixie and Mr. Jinx. When Yogi was given his own show in 1960, he and Boo Boo were replaced with Hokey Wolf and Ding-a-Ling. This is an oversized Color Model/Publicity cel of Huckleberry Hound with Pixie and Dixie, Mr. Jinx, Hokey wolf and Ding-a-Ling. The cel is over a hand-painted Key Master background. This setup created in the Hanna-Barbera Ink and Paint Department and likely used for studio publicity materials, consumer products, children's books, puzzles, etc. The full-figure character images measure in a range of 4\" to 11\" and the overall measurement of massive piece is 23.5\" x 19\". The cel is stuck to the background and there is some slight paint loss in Jinx's left leg; otherwise, condition is Very Good.\nThe Great Grape Ape Show Production Cel and Master Background (Hanna-Barbera, 1975). The Great Grape Ape Show was part of The Tom and Jerry/Grape Ape Show in 1975. Grape Ape is a giant purple gorilla whose companion, Beegle Beagle, often has to solve the problems Grape Ape accidentally causes with his lumbering gait and tremendous strength. From The Great Grape Ape Show we have a colorful Master setup featuring the other \"Purple One\" (tip-o-the hat to Prince and Barney). The cel is hand-painted on 12 field acetate and paired with a Master background from the same episode. The background is hand-painted on 16.5\" background board using gouache. Minor edge wear. Condition is Very Good.\nScooby's All-Star Laff-A-Lympics \"Yogi's Yahooeys\"Production Cel (Hanna-Barbera, 1977). This fun series had three teams competing in cartoon-style Olympic games. The three teams were \"The Yogi Yahooeys,\" \"The Scooby Doobies,\" and \"The Really Rottens.\" Here's a fantastic original hand-painted 5-cel setup featuring members of Yogi's Yahooeys, including Yakky Doodle, Quick Draw McGraw, Boo Boo, Wally Gator, Yogi Bear, Snooper, Blabber, Mr. Jinks, Augie Doggie and Doggie Daddy, and Hokey Wolf! Wow! This is a 12 field cel setup, with figure sizes ranging from 2\" to 5\". Minor handling wear. Very Good condition.\nThe Jetsons Publicity Cel and Background (Hanna-Barbera, 1988). While The Flintstones lived in a comical version of the \"stone age\", complete with machines powered by birds and dinosaurs, The Jetsons live in a comical version of the future, with elaborate robotic contraptions, aliens, holograms, and whimsical inventions. The original series comprised 24 episodes and aired, Sunday nights on ABC premiering on 9/23/62, with prime-time reruns continuing through 9/22/63. Here is a terrific piece showing George, Jane, Judy, Elroy, Orbitty, and Astro doing a happy family dance. The piece was created for use in a Hamilton project for the New York licensing show to introduce the new Hanna-Barbera licensing division; H-B Enterprises. The Jetsons cel was hand-painted at Hanna-Barbera's ink and paint department on 12 field size acetate and paired with a paper-cut background. This rare piece of Jetsons artwork would make a nice acquisition for a discerning collector of animation art. The artwork measures 10.5\" x 14\". Mild production handling. Condition is Very Good.\nFelix the Cat: The Movie Sequenced Production Cel and Master Production Background Setup (New World Pictures, 1988). Felix is back in this great sequence of six hand-painted production cels from Felix the Cat: The Movie, which was made in Europe and released there in 1988. It finally got a US video release in 1991. The cels are matched up on a hand-painted Master production background of an oversize production background. This is a \"wow!\" setup, framed with a massive mat opening of 38\" x 24\". The bottom right cel is signed \"Oriolo\" by Don Oriolo, the son of Felix the Cat comics artist Joe Oriolo. He was one of the producers for this film and wrote some of the music for this film as well. There is a studio seal on that cel also. An incredibly impressive setup, it is matted with a sheet of Plexiglas and backing (but not framed), to an overall size of 44.5\" x 30\". This is a wonderful setup for any fans of Felix! Fine condition. From The Forbes Collection.\nThe Jetsons Master Background (Hanna-Barbera, c. 1985). Here is a beautifully painted original production background from the 1985 season of The Jetsons. The original incarnation of the series aired Sunday nights on ABC from 9/23/62 through 3/3/63. It was Hanna-Barbera's space age complement to The Flintstones. While the Flintstones live in a world with machines powered by birds and dinosaurs, the Jetsons live in a world with elaborate robotic contraptions, aliens, holograms, and whimsical inventions. This Master background has a cel overlay, hand-painted on 12 field size background board. Noted as J-17 BG 120. Mild production handling. Overall condition is Very Good. 260.00 ($312.00 w/Buyer's Premium\nSolar, Man of the Atom #1 (Valiant, 1991) CGC NM+ 9.6 Off-white to white pages. First appearance of Solar. Cover and eight-page insert by Barry Smith. Don Perlin and Bob Layton art. Overstreet 2020 NM- 9.2 value = $20. CGC census 10/20: 229 in 9.6, 395 higher. CGC Cert # 270996006\nTitle\nSolar, Man of the Atom\nIssue\n1 Issue Date 9/91 Issue Year 1991 Publisher Valiant Grad 9.6\nPage Quality OFF-WHITE TO WHITE\nGrade Date 11/03/2015 Grade Category Modern    Art Comments  Jim Shooter story\nDon Perlin & Bob Layton art  Barry Windsor-Smith cover  Key Comments 1st appearance of Solar (Doctor Phil Seleski). 8 page insert by Barry Windsor-Smith.\n\nX-Men Apocalypse Production Cel (Marvel Studios, c. 1992-97). \"I am Apocalypse! Look upon the future, and tremble! All who oppose me shall be crushed!\" Perhaps the scariest supervillain of the X-Men series, the ancient Apocalypse is the oldest known mutant, believed to be the first. Nearly limitlessly powerful, Apocalypse posed the single greatest threat to human- and mutant-kind in the entire run of the groundbreaking animated series. Featured here and centered at a glorious 8.5\" x 6.75\", this spectacular image of X-Men's greatest villain is a must-have for fans of the show. This hand-painted original production cel shows light handling and edge wear, and it is on a printed background for presentation purposes. The condition is Fine.  $170 \n\nMarie Severin Superman Adventures #43 Complete Story Color Guide Group of 22 (DC Comics, 2000). The sensational comic run set in the continuity (and style) of the hit WB cartoon series. The story \"Are You My Mother Box?\" stars Superman, Hot Rod [Cecil], Butch, Maggie Sawyer, Professor Hamilton, Perry White, Lois Lane, Angela Chen, Ron Troupe, Jimmy Olsen, and some Parademons. Hand-colored by Marie Severin over printed line art the 5.75\" x 9\" guides were created in watercolor and colored pencil over. Comes with a copy of the comic. The pages have slight waving from the watercolor and are overall in Very Good condition.\n\nAladdin the Series Sultan and Aladdin Production Cel on Production Background with Animation Drawing Group of 2 (Walt Disney, 1994). The Sultan confides in his future son-in-law Aladdin in this original production cel from Disney TV series sequel to the hit feature film. With cels from the feature film nonexistent, this hand-painted production cel of the title character from the TV series is a rare treat! The 12 field cel is presented over a hand-painted production background of the Sultan's castle uncharacteristically set in a wintery snow-covered setting. The cel image measures 7.5\" x 6.5\" and comes with the matching animation drawing in a sleeve on back of the frame. The master setup is in a 17.5\" x 14.5\" frame under Plexiglas with a mat opening of 12\" x 9\". Condition is Very Good and frame is sold as-is.\n\nDisney Consumer Products Tigger and Rabbit Color Model Cel (Walt Disney, c. 1980-90s). A terrific color model cel featuring Rabbit and Tigger from the Hundred Acre Wood. This hand-painted production cel is from Disney Consumer Products and was used for a book publication. The image shows a startled Rabbit and Tigger who is apparently \"getting outta here!\" The cel is hand-painted on 8.5\" x 11\" acetate and paired with a background copy/print for presentation purposes. The cel is noted as \"Page 10\". Condition is Very Good.  $85 total \nDisney Educational Film Donald Duck Production Cel (Walt Disney, c. 1970-80s). A terrific production cel showing two Donald Ducks! This original production cel is from a Disney educational film. Disney's educational film division made a series of animated shorts using the studios stable of characters to teach on a variety of topics including health and safety. The image was hand-painted on 12 field acetate and paired with a hand-painted Master background. Condition is Very Good.\n\nScooby-Doo Scooby with Guitar Production Cel Setup with Production Background (Hanna-Barbera, c. 1980s). Scoob rocks out in the rain as only he can, in this original hand-painted 3-cel production setup. Great happy image of the snack-loving hound, with an overall image size (not counting raindrops or musical notes) of 4\" x 6.25\". The setup is placed on an appropriate Hanna-Barbera production background, painted with watercolor on stiff board measuring 15\" x 10.5\". Condition is Very Good to Fine, with minor handling wear on the cels. $119 all fees 5/24/21 \n\nGroovie Goolies Original Production Cel  114.50\n\nPINK PANTHER PRODUCTION BACKGROUND HAND PAINTED 11'' X 15''   $20\n1979 MIGHTY MOUSE FILMATION STUDIO PRODUCTION CEL & OBG  $70\nAWESOME Walt Disney PRODUCTION Cel \"The New Adventures of Winnie the Pooh\"  $75\nAWESOME 1979 QUACKULA FILMATION PRODUCTION CEL & OBG! $55\nAWESOME ALVIN & THE CHIPMUNKS PROD CEL & FANTASTIC OBG  $20\nTEX AVERY SHOW PRODUCTION CEL & OBG! WARNER BROTHERS ARTIST $70\n1970'S FAT ALBERT FILMATION PRODUCTION CEL & OBG! $40\nPINK PANTHER PRODUCTION BACKGROUND HAND PAINTED 10 1/2'' x 15'' $30\nTom and Jerry original production animation cel and drawing Filmation 1980-82 61  $58.99\nFRIZ FRELENG \"SHERIFF HOOT KLOOT\"\" RARE PRODUCTION CELS SIGNED 1968 COA (2-Cels) $100\nMIGHTY MOUSE ORIGINAL PRODUCTION ART - Cel & Original Background  $29.99\nTyco Talking Marvin the Martian Factory Sealed $ 6.50\n1993 PINK PANTHER ORIGINAL LARGE CEL PAINTED ART ANIMATED SHOW CAVEMAN PANTHER  $15\n1993 PINK PANTHER ORIGINAL LARGE CEL PAINTED ART ANIMATED SHOW COWBOY PANTHER  $15\nPink Panther Hand Painted Animated Art Cel \"Service With A Smile\" with Sketch Fighting $15\nHeckle and Jeckle Original Hand Painted Production Animation Cel & Sketch  $20\nWARNER BROS \"HIGH DIVING HARE'\" HAND-PAINTED CEL1988 COA - WARNER BROS SEAL  $120\nYosemite Sam Cel With Original Hand Painted Background Signed by Friz Freleng  Framed $325\nHanna-Barbera THE BANANA SPLITS \"TRA LA LA\" Framed Animation Sericel Cel RARE $60\nTitle: The Real Ghostbusters 1987 Production Animation SLIMER Cel & Painted Back DiC\nProduction Company: DiC\nSize: 14\" x 10.5\"\nYear: 1987\nType:  An original, one-of-a-kind production cel and a hand-painted background art. \nCondition: Very Good  $42.50  2/17/22\n\n\n\nSilver – Collectables\n\n1948 by symbol $562 for 4\nX117 (Sterling, Hollowware)\nby Reed & Barton\n\nItem#: 257192 Pattern Code: RDSX117 \nDescription: Sterling, Hollowware Only, Plain\nPattern: X117 (Sterling, Hollowware) by Reed & Barton\nReed & Barton\nCompany History: Family owned, Reed & Barton Corporation is one of the oldest silversmiths in the United States, its roots dating back to 1824.\nOver the years, Reed & Barton has evolved into a diversified tabletop company composed of several divisions. The Reed & Barton Silversmiths division continues to produce a wide range of fine sterling silver, silver plated, and stainless steel tableware and gifts, including flatware, server ware, and hollowware, as well as picture frames, Christmas ornaments, baby gifts, and musicals.\nThe Reed & Barton Handcrafted Chests division is the world’s largest maker of wooden jewelry boxes and flatware chests. In addition, it offers protective rolls and storage bags for flatware and hollowware, cigar humidors, and pen chests. The result of a 1990s acquisition, Miller Rogaska Crystal by Reed & Barton produces handcrafted crystal, including stemware, barware, and giftware. Another acquisition, the Sheffield Silver Company, forms the basis of Reed & Barton: The Sheffield Collection. This division concentrates on hollowware and silver plated tableware, offering products such as serving trays, wine coolers, candle ware, and napkin rings. The R&B Every Day division produces high-quality stainless steel flatware intended for everyday use.\nSterling silver is 92.5% silver with a 7.5% additive, usually copper. Sterling made in the USA after approximately the 1850's always has a sterling mark.  It may say Sterling.  It may be.925 or show the fraction 925/1000.  If it does not have this mark then it is likely not sterling, unless it is foreign made (not in the USA) and has other hallmarks that designate its silver content.   It can also be tested with an acid to determine its content.  This should only be done by a professional.\nSterling flatware always retains it intrinsic silver value & usually a value also as tableware.  Silver plate has no intrinsic silver value.  It is not worth the refining costs to try to redeem the silver. It has very little resale value as tableware.\nSterling will last forever if you want to use it and take care of it.  \n\n\n\n\n", "source_file": "Heritage Auction.docx"}
{"timestamp": "2025-07-05T04:51:55.158042", "category": "Mom's birthday", "content": "June 24th ", "source_file": null}
{"timestamp": "2025-07-05T04:57:41.085839", "category": "NY Friends", "content": "Daniel Locricchio is 69 years old and was born on 07/15/1955.", "source_file": null}
{"timestamp": "2025-07-05T04:58:39.242097", "category": "NY Friends", "content": "Daniel Locricchio is Danny Locricchio", "source_file": null}
{"timestamp": "2025-07-05T04:59:22.266518", "category": "NY Friends", "content": " Danny Locricchio wife is Robin", "source_file": null}
{"timestamp": "2025-07-05T05:01:43.567411", "category": "NY Friends", "content": " Danny and Robin Locricchio live in Islip Terrace, NY", "source_file": null}
{"timestamp": "2025-07-05T05:04:08.156117", "category": "NY Friends", "content": " Danny was a huge NY Islanders fan in the 1980's, he had season tickets during the 4 Stanley Cup Winning seasons.", "source_file": null}
{"timestamp": "2025-07-08T01:01:38.718277", "what": "July 4th 2025", "who": "James Remembered Something", "user_id": "guest"}
{"timestamp": "2025-07-09T14:25:56.224832", "what": "January 28th", "who": "Dad's Birthday", "user_id": "guest"}
